literate/executors/JSDebug.org
#+TITLE: JavaScript Debugger Executor service
#+PROPERTY: header-args    :comments both :tangle ../../src/executors/jsDebug.js

Executors must be XState services and for this one we've chosen the callback type of service.

Insert a JS =debugger;= statement into a running concrete program. Do nothing else.

#+begin_src js
export const service = (C) => (sendParent, receiveParent) => {
    // Reference context so we can inspect it, otherwise JIT gets rid of it.
    C;
    debugger;
    sendParent("DONE");
};
#+end_src


